witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_filters.c
#include "audio_filters.h"
#include "stm32h7xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <math.h>
#include "arm_math.h"
#include "functions.h"
#include "wm8731.h"
#include "settings.h"
#include "noise_reduction.h"
#include "noise_blanker.h"
#include "auto_notch.h"
#include "trx_manager.h"
#include "vad.h"
#include "BiquadDesigner/biquad.h"

// Private variables
static float32_t Fir_RX1_Hilbert_State_I[FIR_RX_HILBERT_STATE_SIZE] = {0}; // buffers of filter states
static float32_t Fir_RX1_Hilbert_State_Q[FIR_RX_HILBERT_STATE_SIZE] = {0};
static float32_t Fir_RX2_Hilbert_State_I[FIR_RX_HILBERT_STATE_SIZE] = {0};
static float32_t Fir_RX2_Hilbert_State_Q[FIR_RX_HILBERT_STATE_SIZE] = {0};
static float32_t Fir_Tx_Hilbert_State_I[FIR_TX_HILBERT_STATE_SIZE] = {0};
static float32_t Fir_Tx_Hilbert_State_Q[FIR_TX_HILBERT_STATE_SIZE] = {0};
static float32_t IIR_RX1_LPF_Coeffs[BIQUAD_COEFF_IN_STAGE * IIR_LPF_STAGES] = {0};
static float32_t IIR_RX1_LPF_I_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX1_LPF_Q_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX1_LPF2_I_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX1_LPF2_Q_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX1_GAUSS_Coeffs[BIQUAD_COEFF_IN_STAGE * GAUSS_STAGES] = {0};
static float32_t IIR_RX1_GAUSS_I_State[IIR_RX_GAUSS_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX1_GAUSS_Q_State[IIR_RX_GAUSS_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX2_LPF_Coeffs[BIQUAD_COEFF_IN_STAGE * IIR_LPF_STAGES] = {0};
static float32_t IIR_RX2_LPF_I_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX2_LPF_Q_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX2_LPF2_I_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX2_LPF2_Q_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX2_GAUSS_Coeffs[BIQUAD_COEFF_IN_STAGE * GAUSS_STAGES] = {0};
static float32_t IIR_RX2_GAUSS_I_State[IIR_RX_GAUSS_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX2_GAUSS_Q_State[IIR_RX_GAUSS_Taps_STATE_SIZE] = {0};
static float32_t IIR_TX_LPF_Coeffs[BIQUAD_COEFF_IN_STAGE * IIR_LPF_STAGES] = {0};
static float32_t IIR_TX_LPF_I_State[IIR_RX_LPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_TX_HPF_Coeffs[BIQUAD_COEFF_IN_STAGE * IIR_HPF_STAGES] = {0};
static float32_t IIR_RX1_HPF_Coeffs[BIQUAD_COEFF_IN_STAGE * IIR_HPF_STAGES] = {0};
static float32_t IIR_RX2_HPF_Coeffs[BIQUAD_COEFF_IN_STAGE * IIR_HPF_STAGES] = {0};
static float32_t IIR_RX1_HPF_I_State[IIR_RX_HPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_RX2_HPF_I_State[IIR_RX_HPF_Taps_STATE_SIZE] = {0};
static float32_t IIR_TX_HPF_I_State[IIR_RX_HPF_Taps_STATE_SIZE] = {0};
static float32_t NOTCH_RX1_Coeffs[BIQUAD_COEFF_IN_STAGE * NOTCH_STAGES] = {0};
static float32_t NOTCH_RX2_Coeffs[BIQUAD_COEFF_IN_STAGE * NOTCH_STAGES] = {0};
static float32_t NOTCH_RX1_State[2 * NOTCH_STAGES] = {0};
static float32_t NOTCH_RX2_State[2 * NOTCH_STAGES] = {0};
static float32_t EQ_RX_I_LOW_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t EQ_RX_I_MID_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t EQ_RX_I_HIG_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t EQ_RX_Q_LOW_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t EQ_RX_Q_MID_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t EQ_RX_Q_HIG_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t EQ_RX_LOW_FILTER_Coeffs[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_RX_MID_FILTER_Coeffs[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_RX_HIG_FILTER_Coeffs[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_MIC_LOW_FILTER_State_SSB[2 * EQ_STAGES] = {0};
static float32_t EQ_MIC_MID_FILTER_State_SSB[2 * EQ_STAGES] = {0};
static float32_t EQ_MIC_HIG_FILTER_State_SSB[2 * EQ_STAGES] = {0};
static float32_t EQ_MIC_LOW_FILTER_Coeffs_SSB[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_MIC_MID_FILTER_Coeffs_SSB[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_MIC_HIG_FILTER_Coeffs_SSB[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_MIC_LOW_FILTER_State_AMFM[2 * EQ_STAGES] = {0};
static float32_t EQ_MIC_MID_FILTER_State_AMFM[2 * EQ_STAGES] = {0};
static float32_t EQ_MIC_HIG_FILTER_State_AMFM[2 * EQ_STAGES] = {0};
static float32_t EQ_MIC_LOW_FILTER_Coeffs_AMFM[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_MIC_MID_FILTER_Coeffs_AMFM[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t EQ_MIC_HIG_FILTER_Coeffs_AMFM[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t AGC_RX1_KW_HSHELF_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t AGC_RX2_KW_HSHELF_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t AGC_RX1_KW_HPASS_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t AGC_RX2_KW_HPASS_FILTER_State[2 * EQ_STAGES] = {0};
static float32_t AGC_RX_KW_HSHELF_FILTER_Coeffs[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t AGC_RX_KW_HPASS_FILTER_Coeffs[BIQUAD_COEFF_IN_STAGE * EQ_STAGES] = {0};
static float32_t SFM_Pilot_Filter_Coeffs[BIQUAD_COEFF_IN_STAGE * SFM_FILTER_STAGES] = {0};
static float32_t SFM_RX1_Pilot_Filter_State[2 * SFM_FILTER_STAGES] = {0};
static float32_t SFM_RX2_Pilot_Filter_State[2 * SFM_FILTER_STAGES] = {0};
static float32_t SFM_Audio_Filter_Coeffs[BIQUAD_COEFF_IN_STAGE * SFM_FILTER_STAGES] = {0};
static float32_t SFM_RX1_Audio_Filter_State[2 * SFM_FILTER_STAGES] = {0};
static float32_t SFM_RX2_Audio_Filter_State[2 * SFM_FILTER_STAGES] = {0};

static DC_filter_state_type DC_Filter_State[8] = {0}; // states of the DC corrector

// Collection of filters
// IQ Hilbert with (-0 q / +90 i) degrees phase added,  48000 sampling frequency Kaiser, Kaiser Beta 4.800 (+90), Raised Cosine 0.930 (-0) // Iowa Hills Hilbert Filters
static const float32_t FIR_HILB_I_coeffs[IQ_HILBERT_TAPS] = {0.000000000000000000, 0.000348718040684899, 0.000000000000000000, 0.000430833440231578, 0.000000000000000000, 0.000522908939129710, 0.000000000000000000, 0.000625643170080525, 0.000000000000000000, 0.000739763696285730, 0.000000000000000000, 0.000866029072658519, 0.000000000000000000, 0.001005231378692548, 0.000000000000000000, 0.001158199311056187, 0.000000000000000000, 0.001325801939712967, 0.000000000000000000, 0.001508953250504772, 0.000000000000000000, 0.001708617620559288, 0.000000000000000000, 0.001925816401721571, 0.000000000000000000, 0.002161635822912572, 0.000000000000000000, 0.002417236466741860, 0.000000000000000000, 0.002693864631427011, 0.000000000000000000, 0.002992865959230020, 0.000000000000000000, 0.003315701801645692, 0.000000000000000000, 0.003663968905292113, 0.000000000000000000, 0.004039423148679463, 0.000000000000000000, 0.004444008249195281, 0.000000000000000000, 0.004879890607273629, 0.000000000000000000, 0.005349501779412148, 0.000000000000000000, 0.005855590504225607, 0.000000000000000000, 0.006401286783911277, 0.000000000000000000, 0.006990181306750123, 0.000000000000000000, 0.007626424567085178, 0.000000000000000000, 0.008314851520255883, 0.000000000000000000, 0.009061139683747135, 0.000000000000000000, 0.009872011537848968, 0.000000000000000000, 0.010755496313062237, 0.000000000000000000, 0.011721272439718031, 0.000000000000000000, 0.012781121134483500, 0.000000000000000000, 0.013949535528809384, 0.000000000000000000, 0.015244551273554119, 0.000000000000000000, 0.016688898584430931, 0.000000000000000000, 0.018311630846033072, 0.000000000000000000, 0.020150476814457717, 0.000000000000000000, 0.022255321565352600, 0.000000000000000000, 0.024693503177301100, 0.000000000000000000, 0.027558135563807963, 0.000000000000000000, 0.030981687165876175, 0.000000000000000000, 0.035159143774044777, 0.000000000000000000, 0.040389700574458606, 0.000000000000000000, 0.047156937867897229, 0.000000000000000000, 0.056296459573201306, 0.000000000000000000, 0.069387047614511754, 0.000000000000000000, 0.089812363821891061, 0.000000000000000000, 0.126370732214445475, 0.000000000000000000, 0.211324043214114715, 0.000000000000000000, 0.635033486245172751, 0.000000000000000000, -0.635033486245172751, 0.000000000000000000, -0.211324043214114715, 0.000000000000000000, -0.126370732214445475, 0.000000000000000000, -0.089812363821891061, 0.000000000000000000, -0.069387047614511754, 0.000000000000000000, -0.056296459573201306, 0.000000000000000000, -0.047156937867897229, 0.000000000000000000, -0.040389700574458606, 0.000000000000000000, -0.035159143774044777, 0.000000000000000000, -0.030981687165876175, 0.000000000000000000, -0.027558135563807963, 0.000000000000000000, -0.024693503177301100, 0.000000000000000000, -0.022255321565352600, 0.000000000000000000, -0.020150476814457717, 0.000000000000000000, -0.018311630846033072, 0.000000000000000000, -0.016688898584430931, 0.000000000000000000, -0.015244551273554119, 0.000000000000000000, -0.013949535528809384, 0.000000000000000000, -0.012781121134483500, 0.000000000000000000, -0.011721272439718031, 0.000000000000000000, -0.010755496313062237, 0.000000000000000000, -0.009872011537848968, 0.000000000000000000, -0.009061139683747135, 0.000000000000000000, -0.008314851520255883, 0.000000000000000000, -0.007626424567085178, 0.000000000000000000, -0.006990181306750123, 0.000000000000000000, -0.006401286783911277, 0.000000000000000000, -0.005855590504225607, 0.000000000000000000, -0.005349501779412148, 0.000000000000000000, -0.004879890607273629, 0.000000000000000000, -0.004444008249195281, 0.000000000000000000, -0.004039423148679463, 0.000000000000000000, -0.003663968905292113, 0.000000000000000000, -0.003315701801645692, 0.000000000000000000, -0.002992865959230020, 0.000000000000000000, -0.002693864631427011, 0.000000000000000000, -0.002417236466741860, 0.000000000000000000, -0.002161635822912572, 0.000000000000000000, -0.001925816401721571, 0.000000000000000000, -0.001708617620559288, 0.000000000000000000, -0.001508953250504772, 0.000000000000000000, -0.001325801939712967, 0.000000000000000000, -0.001158199311056187, 0.000000000000000000, -0.001005231378692548, 0.000000000000000000, -0.000866029072658519, 0.000000000000000000, -0.000739763696285730, 0.000000000000000000, -0.000625643170080525, 0.000000000000000000, -0.000522908939129710, 0.000000000000000000, -0.000430833440231578, 0.000000000000000000, -0.000348718040684899, 0.000000000000000000};
static const float32_t FIR_HILB_Q_coeffs[IQ_HILBERT_TAPS] = {-0.000056786545255326, 263.1346287525080E-18, -0.000071793697491707, 391.3417109364890E-18, -0.000088874802368221, 336.4125900077540E-18, -0.000108170884956264, 392.7791496728210E-18, -0.000129819032785321, 590.4838201243310E-18, -0.000153950719729993, 596.8112038672230E-18, -0.000180690067531663, 746.3322026715040E-18, -0.000210152062867355, 1.093346048537350E-15, -0.000242440749545727, 1.065677310743770E-15, -0.000277647416860387, 1.039585124576320E-15, -0.000315848806349421, 1.538815826232670E-15, -0.000357105360160803, 1.666207014701170E-15, -0.000401459534874215, 1.539685561133540E-15, -0.000448934204947304, 2.660369443631100E-15, -0.000499531179987328, 3.040479628793550E-15, -0.000553229859656923, 1.044067344343770E-15, -0.000609986049322792, 2.032026148997660E-15, -0.000669730958505527, 6.994036442534390E-15, -0.000732370402749788, 7.411458451156190E-15, -0.000797784227648926, 3.101364677149160E-15, -0.000865825971964948, 2.594164153512510E-15, -0.000936322783811445, 5.348323407953660E-15, -0.001009075601815882, 5.884744611617880E-15, -0.001083859609627728, 5.492731038694370E-15, -0.001160424969305250, 6.445309139376350E-15, -0.001238497835651963, 6.872918232978370E-15, -0.001317781650032627, 6.663418858584270E-15, -0.001397958708679671, 8.133197857946460E-15, -0.001478691996873688, 9.905768905631310E-15, -0.001559627276797271, 10.20890941488510E-15, -0.001640395413295664, 11.20755554836600E-15, -0.001720614918466468, 12.64985408146260E-15, -0.001799894692718967, 12.97295013621260E-15, -0.001877836936972348, 14.24353199778040E-15, -0.001954040207976172, 16.47390711328630E-15, -0.002028102586337237, 18.06444101550620E-15, -0.002099624924798889, 19.78135011594340E-15, -0.002168214142707746, 21.50931561512560E-15, -0.002233486531418778, 23.52243144574740E-15, -0.002295071034610703, 26.83685625665210E-15, -0.002352612467220998, 30.78295485673010E-15, -0.002405774636936983, 35.50722610113330E-15, -0.002454243332825246, 40.92479516392550E-15, -0.002497729146841703, 46.97877831911210E-15, -0.002535970095673103, 56.20264720417670E-15, -0.002568734012302652, 69.94947997469540E-15, -0.002595820679318180, 90.43954876597660E-15, -0.002617063678801859, 127.2729571918730E-15, -0.002632331936897800, 212.5921889885520E-15, -0.002641530944731846, 638.3507757132560E-15, 0.997207486382091335, 638.3507757132560E-15, -0.002641530944731846, 212.5921889885520E-15, -0.002632331936897800, 127.2729571918730E-15, -0.002617063678801859, 90.43954876597660E-15, -0.002595820679318180, 69.94947997469540E-15, -0.002568734012302652, 56.20264720417670E-15, -0.002535970095673103, 46.97877831911210E-15, -0.002497729146841703, 40.92479516392550E-15, -0.002454243332825246, 35.50722610113330E-15, -0.002405774636936983, 30.78295485673010E-15, -0.002352612467220998, 26.83685625665210E-15, -0.002295071034610703, 23.52243144574740E-15, -0.002233486531418778, 21.50931561512560E-15, -0.002168214142707746, 19.78135011594340E-15, -0.002099624924798889, 18.06444101550620E-15, -0.002028102586337237, 16.47390711328630E-15, -0.001954040207976172, 14.24353199778040E-15, -0.001877836936972348, 12.97295013621260E-15, -0.001799894692718967, 12.64985408146260E-15, -0.001720614918466468, 11.20755554836600E-15, -0.001640395413295664, 10.20890941488510E-15, -0.001559627276797271, 9.905768905631310E-15, -0.001478691996873688, 8.133197857946460E-15, -0.001397958708679671, 6.663418858584270E-15, -0.001317781650032627, 6.872918232978370E-15, -0.001238497835651963, 6.445309139376350E-15, -0.001160424969305250, 5.492731038694370E-15, -0.001083859609627728, 5.884744611617880E-15, -0.001009075601815882, 5.348323407953660E-15, -0.000936322783811445, 2.594164153512510E-15, -0.000865825971964948, 3.101364677149160E-15, -0.000797784227648926, 7.411458451156190E-15, -0.000732370402749788, 6.994036442534390E-15, -0.000669730958505527, 2.032026148997660E-15, -0.000609986049322792, 1.044067344343770E-15, -0.000553229859656923, 3.040479628793550E-15, -0.000499531179987328, 2.660369443631100E-15, -0.000448934204947304, 1.539685561133540E-15, -0.000401459534874215, 1.666207014701170E-15, -0.000357105360160803, 1.538815826232670E-15, -0.000315848806349421, 1.039585124576320E-15, -0.000277647416860387, 1.065677310743770E-15, -0.000242440749545727, 1.093346048537350E-15, -0.000210152062867355, 746.3322026715040E-18, -0.000180690067531663, 596.8112038672230E-18, -0.000153950719729993, 590.4838201243310E-18, -0.000129819032785321, 392.7791496728210E-18, -0.000108170884956264, 336.4125900077540E-18, -0.000088874802368221, 391.3417109364890E-18, -0.000071793697491707, 263.1346287525080E-18, -0.000056786545255326};

//////Decimation FIR Filter
static const float32_t DECIMATE_FIR_Coeffs[4] = {-0.05698952454792, 0.5574889164132, 0.5574889164132, -0.05698952454792};
arm_fir_decimate_instance_f32 DECIMATE_FIR_RX1_AUDIO_I =
	{
		.M = 2,
		.numTaps = 4,
		.pCoeffs = DECIMATE_FIR_Coeffs,
		.pState = (float32_t[FPGA_RX_IQ_BUFFER_HALF_SIZE + 4 - 1]){0}};
arm_fir_decimate_instance_f32 DECIMATE_FIR_RX1_AUDIO_Q =
	{
		.M = 2,
		.numTaps = 4,
		.pCoeffs = DECIMATE_FIR_Coeffs,
		.pState = (float32_t[FPGA_RX_IQ_BUFFER_HALF_SIZE + 4 - 1]){0}};
arm_fir_decimate_instance_f32 DECIMATE_FIR_RX2_AUDIO_I =
	{
		.M = 2,
		.numTaps = 4,
		.pCoeffs = DECIMATE_FIR_Coeffs,
		.pState = (float32_t[FPGA_RX_IQ_BUFFER_HALF_SIZE + 4 - 1]){0}};
arm_fir_decimate_instance_f32 DECIMATE_FIR_RX2_AUDIO_Q =
	{
		.M = 2,
		.numTaps = 4,
		.pCoeffs = DECIMATE_FIR_Coeffs,
		.pState = (float32_t[FPGA_RX_IQ_BUFFER_HALF_SIZE + 4 - 1]){0}};
// Decimation IIR filter
static float32_t DECIMATE_IIR_Coeffs[IIR_DECIMATOR_FILTER_STAGES * BIQUAD_COEFF_IN_STAGE] = {0};
arm_biquad_cascade_df2T_instance_f32 DECIMATE_IIR_RX1_AUDIO_I =
	{
		.numStages = IIR_DECIMATOR_FILTER_STAGES,
		.pState = (float32_t[IIR_DECIMATOR_FILTER_STAGES * 2]){0},
		.pCoeffs = DECIMATE_IIR_Coeffs,
};
arm_biquad_cascade_df2T_instance_f32 DECIMATE_IIR_RX1_AUDIO_Q =
	{
		.numStages = IIR_DECIMATOR_FILTER_STAGES,
		.pState = (float32_t[IIR_DECIMATOR_FILTER_STAGES * 2]){0},
		.pCoeffs = DECIMATE_IIR_Coeffs,
};
