witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_filters.c
// initialize audio filters
void InitAudioFilters(void)
{
	// TX Hilbert
	arm_fir_init_f32(&FIR_TX_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs[0], (float32_t *)&Fir_Tx_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
	arm_fir_init_f32(&FIR_TX_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs[0], (float32_t *)&Fir_Tx_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);

	// AGC K-Weight LKFS BS.1770
	calcBiquad(BIQUAD_highShelf, 1500, TRX_SAMPLERATE, 1.0f / SQRT2, 4.0f, AGC_RX_KW_HSHELF_FILTER_Coeffs);
	calcBiquad(BIQUAD_highpass, 38, TRX_SAMPLERATE, 0.5f, 0.0f, AGC_RX_KW_HPASS_FILTER_Coeffs);

	// Other
	InitNoiseReduction();
	InitNotchFilter();
	InitAutoNotchReduction();
	InitVAD();
	ReinitAudioFilters();
}

// reinitialize audio filters
void ReinitAudioFilters(void)
{
	// RX1 Hilbert
    arm_fir_init_f32(&FIR_RX1_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs[0], (float32_t *)&Fir_RX1_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
    arm_fir_init_f32(&FIR_RX1_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs[0], (float32_t *)&Fir_RX1_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);

	// RX2 Hilbert
    arm_fir_init_f32(&FIR_RX2_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs[0], (float32_t *)&Fir_RX2_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
    arm_fir_init_f32(&FIR_RX2_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs[0], (float32_t *)&Fir_RX2_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);

	// parameters
	uint32_t hpf_tx_width = 300;  // default settings
	uint32_t hpf_rx1_width = 300; // default settings
	if (CurrentVFO->HPF_RX_Filter_Width > 0)
		hpf_rx1_width = CurrentVFO->HPF_RX_Filter_Width;
	if (CurrentVFO->HPF_TX_Filter_Width > 0)
		hpf_tx_width = CurrentVFO->HPF_TX_Filter_Width;
	//
	uint32_t hpf_rx2_width = 300; // default settings
	if (SecondaryVFO->HPF_RX_Filter_Width > 0)
		hpf_rx2_width = SecondaryVFO->HPF_RX_Filter_Width;
	//
	uint32_t lpf_rx1_width = 2700; // default settings
	if (CurrentVFO->LPF_RX_Filter_Width > 0)
		lpf_rx1_width = CurrentVFO->LPF_RX_Filter_Width;
	if (lpf_rx1_width < hpf_rx1_width && CurrentVFO->HPF_RX_Filter_Width > 0)
		lpf_rx1_width = hpf_rx1_width + 100;
	if (CurrentVFO->Mode == TRX_MODE_NFM || CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM || CurrentVFO->Mode == TRX_MODE_CW)
		lpf_rx1_width /= 2;
	//
	uint32_t lpf_rx2_width = 2700; // default settings
	if (SecondaryVFO->LPF_RX_Filter_Width > 0)
		lpf_rx2_width = SecondaryVFO->LPF_RX_Filter_Width;
	if (lpf_rx2_width < hpf_rx2_width && SecondaryVFO->HPF_RX_Filter_Width > 0)
		lpf_rx2_width = hpf_rx2_width + 100;
	if (CurrentVFO->Mode == TRX_MODE_NFM || CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM || CurrentVFO->Mode == TRX_MODE_CW)
		lpf_rx2_width /= 2;
	//
	uint32_t lpf_tx_width = 2700; // default settings
	if (CurrentVFO->LPF_TX_Filter_Width > 0)
		lpf_tx_width = CurrentVFO->LPF_TX_Filter_Width;
	if (lpf_tx_width < hpf_tx_width)
		lpf_tx_width = hpf_tx_width + 100;
	if (CurrentVFO->Mode == TRX_MODE_NFM || CurrentVFO->Mode == TRX_MODE_AM || CurrentVFO->Mode == TRX_MODE_SAM || CurrentVFO->Mode == TRX_MODE_CW)
		lpf_tx_width /= 2;
	//

	// Decimator filters
	uint32_t decim_iir_filter_stages = IIR_DECIMATOR_FILTER_STAGES;
	uint32_t decim_iir_filter_width = 20000;
	if (lpf_rx1_width < 5000 && (!TRX.Dual_RX || lpf_rx2_width < 5000))
		decim_iir_filter_width = 5000;
	if (TRX_GetRXSampleRateENUM == TRX_SAMPLERATE_K192)
		decim_iir_filter_stages = 5;
	if (TRX_GetRXSampleRateENUM == TRX_SAMPLERATE_K384)
		decim_iir_filter_stages = 3;
	iir_filter_t *filter = biquad_create(decim_iir_filter_stages);
	biquad_init_lowpass(filter, TRX_GetRXSampleRate, 20000);
	fill_biquad_coeffs(filter, DECIMATE_IIR_Coeffs, decim_iir_filter_stages);
	uint32_t need_decimate_rate = TRX_GetRXSampleRate / TRX_SAMPLERATE;
	DECIMATE_FIR_RX1_AUDIO_I.M = need_decimate_rate;
	DECIMATE_FIR_RX1_AUDIO_Q.M = need_decimate_rate;
	DECIMATE_FIR_RX2_AUDIO_I.M = need_decimate_rate;
	DECIMATE_FIR_RX2_AUDIO_Q.M = need_decimate_rate;
	DECIMATE_IIR_RX1_AUDIO_I.numStages = decim_iir_filter_stages;
	DECIMATE_IIR_RX1_AUDIO_Q.numStages = decim_iir_filter_stages;

	// LPF RX1
	filter = biquad_create(IIR_LPF_STAGES);
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_rx1_width);
	fill_biquad_coeffs(filter, IIR_RX1_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF_I, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF_Q, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF_Q_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF2_I, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF2_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF2_Q, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF2_Q_State[0]);

	// LPF TX
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_tx_width);
	fill_biquad_coeffs(filter, IIR_TX_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_TX_LPF_I, IIR_LPF_STAGES, IIR_TX_LPF_Coeffs, (float32_t *)&IIR_TX_LPF_I_State[0]);

	// LPF RX2
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_rx2_width);
	fill_biquad_coeffs(filter, IIR_RX2_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF_I, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF_Q, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF_Q_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF2_I, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF2_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF2_Q, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF2_Q_State[0]);

	// HPF RX1
	filter = biquad_create(IIR_HPF_STAGES);
	biquad_init_highpass(filter, TRX_SAMPLERATE, hpf_rx1_width);
	fill_biquad_coeffs(filter, IIR_RX1_HPF_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_HPF_I, IIR_HPF_STAGES, IIR_RX1_HPF_Coeffs, (float32_t *)&IIR_RX1_HPF_I_State[0]);

	// HPF RX2
	biquad_init_highpass(filter, TRX_SAMPLERATE, hpf_rx2_width);
	fill_biquad_coeffs(filter, IIR_RX2_HPF_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_HPF_I, IIR_HPF_STAGES, IIR_RX2_HPF_Coeffs, (float32_t *)&IIR_RX2_HPF_I_State[0]);

	// HPF TX
	biquad_init_highpass(filter, TRX_SAMPLERATE, hpf_tx_width);
	fill_biquad_coeffs(filter, IIR_TX_HPF_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_TX_HPF_I, IIR_HPF_STAGES, IIR_TX_HPF_Coeffs, (float32_t *)&IIR_TX_HPF_I_State[0]);

	// RX1 GAUSS
	filter = biquad_create(GAUSS_STAGES);
	biquad_init_lowpass(filter, TRX_SAMPLERATE, GAUSS_WIDTH / 2);
	fill_biquad_coeffs(filter, IIR_RX1_GAUSS_Coeffs, GAUSS_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_GAUSS_I, GAUSS_STAGES, IIR_RX1_GAUSS_Coeffs, (float32_t *)&IIR_RX1_GAUSS_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_GAUSS_Q, GAUSS_STAGES, IIR_RX1_GAUSS_Coeffs, (float32_t *)&IIR_RX1_GAUSS_Q_State[0]);

	// RX2 GAUSS
	biquad_init_lowpass(filter, TRX_SAMPLERATE, GAUSS_WIDTH / 2);
	fill_biquad_coeffs(filter, IIR_RX2_GAUSS_Coeffs, GAUSS_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_GAUSS_I, GAUSS_STAGES, IIR_RX2_GAUSS_Coeffs, (float32_t *)&IIR_RX2_GAUSS_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_GAUSS_Q, GAUSS_STAGES, IIR_RX2_GAUSS_Coeffs, (float32_t *)&IIR_RX2_GAUSS_Q_State[0]);

	// RX Equalizer
	calcBiquad(BIQUAD_peak, 400, TRX_SAMPLERATE, 0.5f, TRX.RX_EQ_LOW, EQ_RX_LOW_FILTER_Coeffs);
	calcBiquad(BIQUAD_peak, 1000, TRX_SAMPLERATE, 1.0f, TRX.RX_EQ_MID, EQ_RX_MID_FILTER_Coeffs);
	calcBiquad(BIQUAD_peak, 2000, TRX_SAMPLERATE, 1.5f, TRX.RX_EQ_HIG, EQ_RX_HIG_FILTER_Coeffs);

	// MIC Equalizer
	calcBiquad(BIQUAD_peak, 400, TRX_SAMPLERATE, 0.5f, TRX.MIC_EQ_LOW_SSB, EQ_MIC_LOW_FILTER_Coeffs_SSB);
	calcBiquad(BIQUAD_peak, 1000, TRX_SAMPLERATE, 1.0f, TRX.MIC_EQ_MID_SSB, EQ_MIC_MID_FILTER_Coeffs_SSB);
	calcBiquad(BIQUAD_peak, 2000, TRX_SAMPLERATE, 1.5f, TRX.MIC_EQ_HIG_SSB, EQ_MIC_HIG_FILTER_Coeffs_SSB);
	calcBiquad(BIQUAD_peak, 400, TRX_SAMPLERATE, 0.5f, TRX.MIC_EQ_LOW_AMFM, EQ_MIC_LOW_FILTER_Coeffs_AMFM);
	calcBiquad(BIQUAD_peak, 1000, TRX_SAMPLERATE, 1.0f, TRX.MIC_EQ_MID_AMFM, EQ_MIC_MID_FILTER_Coeffs_AMFM);
	calcBiquad(BIQUAD_peak, 2000, TRX_SAMPLERATE, 1.5f, TRX.MIC_EQ_HIG_AMFM, EQ_MIC_HIG_FILTER_Coeffs_AMFM);

	// Stereo FM pilot
	filter = biquad_create(SFM_FILTER_STAGES);
	biquad_init_bandpass(filter, TRX_GetRXSampleRate, SWFM_PILOT_TONE_FREQ - 100, SWFM_PILOT_TONE_FREQ + 100);
	fill_biquad_coeffs(filter, SFM_Pilot_Filter_Coeffs, SFM_FILTER_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&SFM_RX1_Pilot_Filter, SFM_FILTER_STAGES, SFM_Pilot_Filter_Coeffs, SFM_RX1_Pilot_Filter_State);
	arm_biquad_cascade_df2T_initNoClean_f32(&SFM_RX2_Pilot_Filter, SFM_FILTER_STAGES, SFM_Pilot_Filter_Coeffs, SFM_RX2_Pilot_Filter_State);

	// Stereo FM audio
	filter = biquad_create(SFM_FILTER_STAGES);
	biquad_init_bandpass(filter, TRX_GetRXSampleRate, SWFM_STEREO_PILOT_TONE_FREQ - SWFM_STEREO_AUDIO_HALF_WIDTH, SWFM_STEREO_PILOT_TONE_FREQ + SWFM_STEREO_AUDIO_HALF_WIDTH);
	fill_biquad_coeffs(filter, SFM_Audio_Filter_Coeffs, SFM_FILTER_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&SFM_RX1_Audio_Filter, SFM_FILTER_STAGES, SFM_Audio_Filter_Coeffs, SFM_RX1_Audio_Filter_State);
	arm_biquad_cascade_df2T_initNoClean_f32(&SFM_RX2_Audio_Filter, SFM_FILTER_STAGES, SFM_Audio_Filter_Coeffs, SFM_RX2_Audio_Filter_State);

	// All done
	NeedReinitAudioFilters = false;
	NeedReinitAudioFiltersClean = false;
}

// initialize the manual Notch filter
void InitNotchFilter(void)
{
	if (CurrentVFO->NotchFC > CurrentVFO->LPF_RX_Filter_Width)
		CurrentVFO->NotchFC = CurrentVFO->LPF_RX_Filter_Width;
	if (SecondaryVFO->NotchFC > SecondaryVFO->LPF_RX_Filter_Width)
		SecondaryVFO->NotchFC = SecondaryVFO->LPF_RX_Filter_Width;

	int16_t rx1_notch_width_hz = 100;
	int16_t rx2_notch_width_hz = 100;
	int16_t rx1_notch_pos = CurrentVFO->NotchFC;
	int16_t rx2_notch_pos = SecondaryVFO->NotchFC;

	if (CurrentVFO->Mode == TRX_MODE_CW)
		rx1_notch_pos = (TRX.CW_Pitch + CurrentVFO->NotchFC - CurrentVFO->LPF_RX_Filter_Width / 2);
	if (SecondaryVFO->Mode == TRX_MODE_CW)
		rx2_notch_pos = (TRX.CW_Pitch + SecondaryVFO->NotchFC - SecondaryVFO->LPF_RX_Filter_Width / 2);

	int16_t rx1_notch_pos_f1 = rx1_notch_pos - rx1_notch_width_hz / 2;
	int16_t rx1_notch_pos_f2 = rx1_notch_pos + rx1_notch_width_hz / 2;
	int16_t rx2_notch_pos_f1 = rx2_notch_pos - rx2_notch_width_hz / 2;
	int16_t rx2_notch_pos_f2 = rx2_notch_pos + rx2_notch_width_hz / 2;
	if (rx1_notch_pos_f1 < 50)
		rx1_notch_pos_f1 = 50;
	if (rx2_notch_pos_f1 < 50)
		rx2_notch_pos_f1 = 50;
	if (rx1_notch_pos_f2 > TRX_SAMPLERATE / 2)
		rx1_notch_pos_f2 = TRX_SAMPLERATE / 2;
	if (rx2_notch_pos_f2 > TRX_SAMPLERATE / 2)
		rx2_notch_pos_f2 = TRX_SAMPLERATE / 2;

	iir_filter_t *filter = biquad_create(NOTCH_STAGES);
	biquad_init_bandstop(filter, TRX_SAMPLERATE, rx1_notch_pos_f1, rx1_notch_pos_f2);
	fill_biquad_coeffs(filter, NOTCH_RX1_Coeffs, NOTCH_STAGES);

	filter = biquad_create(NOTCH_STAGES);
	biquad_init_bandstop(filter, TRX_SAMPLERATE, rx2_notch_pos_f1, rx2_notch_pos_f2);
	fill_biquad_coeffs(filter, NOTCH_RX2_Coeffs, NOTCH_STAGES);

