witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_filters.c
	arm_biquad_cascade_df2T_initNoClean_f32(&NOTCH_RX1_FILTER, NOTCH_STAGES, NOTCH_RX1_Coeffs, NOTCH_RX1_State);
	arm_biquad_cascade_df2T_initNoClean_f32(&NOTCH_RX2_FILTER, NOTCH_STAGES, NOTCH_RX2_Coeffs, NOTCH_RX2_State);

	NeedReinitNotch = false;
}

// start DC corrector
void dc_filter(float32_t *Buffer, int16_t blockSize, DC_FILTER_STATE stateNum) // removes the DC component of the signal
{
	static const float32_t A1 = (1.0f - 0.00048828125f); // (1-2^(-11))

	for (uint16_t i = 0; i < blockSize; i++)
	{
		float32_t sampleIn = Buffer[i];
		float32_t sampleOut = 0;
		float32_t delta_x = sampleIn - DC_Filter_State[stateNum].x_prev;
		float32_t a1_y_prev = A1 * DC_Filter_State[stateNum].y_prev;
		sampleOut = delta_x + a1_y_prev;
		DC_Filter_State[stateNum].x_prev = sampleIn;
		DC_Filter_State[stateNum].y_prev = sampleOut;
		Buffer[i] = sampleOut;
	}
}

// automatic calculation of the Biquad filter
static void calcBiquad(BIQUAD_TYPE type, uint32_t Fc, uint32_t Fs, float32_t Q, float32_t peakGain, float32_t *outCoeffs)
{
	float32_t a0, a1, a2, b1, b2, norm;

	float32_t V = powf(10.0f, fabsf(peakGain) / 20.0f);
	float32_t K = tanf(PI * Fc / Fs);
	switch (type)
	{
	case BIQUAD_onepolelp:
		b1 = expf(-2.0f * PI * (Fc / Fs));
		a0 = 1.0f - b1;
		b1 = -b1;
		a1 = a2 = b2 = 0.0f;
		break;

	case BIQUAD_onepolehp:
		b1 = -expf(-2.0f * PI * (0.5f - Fc / Fs));
		a0 = 1.0f + b1;
		b1 = -b1;
		a1 = a2 = b2 = 0.0f;
		break;

	case BIQUAD_lowpass:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = K * K * norm;
		a1 = 2.0f * a0;
		a2 = a0;
		b1 = 2.0f * (K * K - 1.0f) * norm;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_highpass:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = 1.0f * norm;
		a1 = -2.0f * a0;
		a2 = a0;
		b1 = 2.0f * (K * K - 1.0f) * norm;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_bandpass:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = K / Q * norm;
		a1 = 0.0f;
		a2 = -a0;
		b1 = 2.0f * (K * K - 1.0f) * norm;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_notch:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = (1.0f + K * K) * norm;
		a1 = 2.0f * (K * K - 1.0f) * norm;
		a2 = a0;
		b1 = a1;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_peak:
		if (peakGain >= 0.0f)
		{
			norm = 1.0f / (1.0f + 1.0f / Q * K + K * K);
			a0 = (1.0f + V / Q * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - V / Q * K + K * K) * norm;
			b1 = a1;
			b2 = (1.0f - 1.0f / Q * K + K * K) * norm;
		}
		else
		{
			norm = 1.0f / (1.0f + V / Q * K + K * K);
			a0 = (1.0f + 1.0f / Q * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - 1.0f / Q * K + K * K) * norm;
			b1 = a1;
			b2 = (1.0f - V / Q * K + K * K) * norm;
		}
		break;
	case BIQUAD_lowShelf:
		if (peakGain >= 0.0f)
		{
			norm = 1.0f / (1.0f + SQRT2 * K + K * K);
			a0 = (1.0f + sqrtf(2.0f * V) * K + V * K * K) * norm;
			a1 = 2.0f * (V * K * K - 1.0f) * norm;
			a2 = (1.0f - sqrtf(2.0f * V) * K + V * K * K) * norm;
			b1 = 2.0f * (K * K - 1.0f) * norm;
			b2 = (1.0f - SQRT2 * K + K * K) * norm;
		}
		else
		{
			norm = 1.0f / (1.0f + sqrtf(2.0f * V) * K + V * K * K);
			a0 = (1.0f + SQRT2 * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - SQRT2 * K + K * K) * norm;
			b1 = 2.0f * (V * K * K - 1.0f) * norm;
			b2 = (1.0f - sqrtf(2.0f * V) * K + V * K * K) * norm;
		}
		break;
	case BIQUAD_highShelf:
    default:
		if (peakGain >= 0.0f)
		{
			norm = 1.0f / (1.0f + SQRT2 * K + K * K);
			a0 = (V + sqrtf(2.0f * V) * K + K * K) * norm;
			a1 = 2.0f * (K * K - V) * norm;
			a2 = (V - sqrtf(2.0f * V) * K + K * K) * norm;
			b1 = 2.0f * (K * K - 1.0f) * norm;
			b2 = (1.0f - SQRT2 * K + K * K) * norm;
		}
		else
		{
			norm = 1.0f / (V + sqrtf(2.0f * V) * K + K * K);
			a0 = (1.0f + SQRT2 * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - SQRT2 * K + K * K) * norm;
			b1 = 2.0f * (K * K - V) * norm;
			b2 = (V - sqrtf(2.0f * V) * K + K * K) * norm;
		}
		break;
	}

	// save coefficients
	outCoeffs[0] = a0;
	outCoeffs[1] = a1;
	outCoeffs[2] = a2;
	outCoeffs[3] = -b1;
	outCoeffs[4] = -b2;
}

static void arm_biquad_cascade_df2T_initNoClean_f32(arm_biquad_cascade_df2T_instance_f32 *S, uint8_t numStages, const float32_t *pCoeffs, float32_t *pState)
{
	if (NeedReinitAudioFiltersClean) // original func
	{
		arm_biquad_cascade_df2T_init_f32(S, numStages, pCoeffs, pState);
		return;
	}

	/* Assign filter stages */
	S->numStages = numStages;

	/* Assign coefficient pointer */
	S->pCoeffs = pCoeffs;

	/* Assign state pointer */
	S->pState = pState;
}

void fill_biquad_coeffs(iir_filter_t *filter, float32_t *coeffs, uint8_t sect_num)
{
	// transpose and save coefficients
	uint16_t ind = 0;
	for (uint8_t sect = 0; sect < sect_num; sect++)
	{
		coeffs[ind + 0] = filter->b[sect * 3 + 0];
		coeffs[ind + 1] = filter->b[sect * 3 + 1];
		coeffs[ind + 2] = filter->b[sect * 3 + 2];
		coeffs[ind + 3] = -filter->a[sect * 3 + 1];
		coeffs[ind + 4] = -filter->a[sect * 3 + 2];
		ind += 5;
	}
}
